writing-6502-disassembler.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-28 Thu 17:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing 6502 Disassembler in Rust</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Huy Tran" />
<link rel="stylesheet" type="text/css" href="css/hack.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Writing 6502 Disassembler in Rust</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org013487c">1. Little-endian memory layout</a></li>
<li><a href="#org766c603">2. MOS 6502 Opcode Structure</a></li>
<li><a href="#org3644716">3. Reading binary file in Rust</a></li>
<li><a href="#org792cb95">4. Parsing Opcode from byte vector</a></li>
<li><a href="#orge543760">5. Use match to write code faster</a></li>
<li><a href="#orgec4cac2">6. What's next?</a></li>
</ul>
</div>
</div>
<p>
In this post, I am talking about writing a disassembler for <b><b>MOS 6502</b></b> microprocessor. It is a very first step to building a sophisticated emulator such as <b><b>NES</b></b> or even <b><b>Apple II</b></b>. 
</p>

<p>
It is recommended to read about implementing CHIP-8 interpreter first. If you are not familiar with it, so I can wait, just go and read, then come back.
</p>

<div id="outline-container-org013487c" class="outline-2">
<h2 id="org013487c"><span class="section-number-2">1</span> Little-endian memory layout</h2>
<div class="outline-text-2" id="text-1">
<p>
One of the most important things you need to know before building anything with MOS 6502 is: It is a <b><b>little-endian 8-bit microprocessor</b></b>. So what do it mean?
</p>

<p>
The <a href="http://www.thealmightyguru.com/Games/Hacking/Wiki/index.php/Little-endian">NES Hacker</a> has an excellent explanation about how 6502 stores memory.
</p>

<p>
The table below tells us the difference between Little-Endian and Big-Endian:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><b><b>Hex Value</b></b></th>
<th scope="col" class="org-left"><b><b>Byte Value</b></b></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b><b>Little-Endian</b></b></td>
<td class="org-left">$1000</td>
<td class="org-left">00 10</td>
</tr>

<tr>
<td class="org-left"><b><b>Big-Endian</b></b></td>
<td class="org-left">$1000</td>
<td class="org-left">10 00</td>
</tr>
</tbody>
</table>

<p>
It is the assembler's job to take care of the order of memory addresses and values to make sure they are in Little-Endian. However, you are building a disassembler, so you need to aware of this layout as well.
</p>

<p>
For example, this is the instruction to load memory from address <code>$0200</code> using assembly:
</p>

<pre class="example">
LDA $0200
</pre>

<p>
The compiled machine code should be:
</p>

<pre class="example">
AD 00 02
</pre>

<p>
The high and low bytes of the memory address has been swapped because the 6502 using Little-Endian.
</p>
</div>
</div>

<div id="outline-container-org766c603" class="outline-2">
<h2 id="org766c603"><span class="section-number-2">2</span> MOS 6502 Opcode Structure</h2>
<div class="outline-text-2" id="text-2">
<p>
Every instruction starts with an Opcode, which is a 3 characters Assembly code, following with an Operand (the data).
</p>

<p>
For example:
</p>

<pre class="example">
JMP $1000
</pre>

<p>
The code above is an instruction to move the program counter to address <code>$1000</code>.
</p>

<p>
When compiled to machine code, an Opcode always takes <b><b>1 byte</b></b>. For example, the code above compiles to machine code as:
</p>

<pre class="example">
4C 00 10
</pre>

<p>
The number of Operands depends on the Opcode, so when reading or disassembling, we need to increase the program counter based on the Opcode.
</p>

<p>
During the implementation, you need to constantly refer to the <a href="http://e-tradition.net/bytes/6502/6502_instruction_set.html">6502 Instruction Set</a>. This document aggregates the Opcode based on its High and Low nibbles.
</p>

<p>
To read the nibbles, we use the bitwise <code>AND</code> operator:
</p>

<pre class="example">
let opcode = 0xA9;
let low = opcode &amp; 0x000F;             // you get "9"
let high = (opcode &amp; 0x00F0) &gt;&gt; 4;     // you get "A"
</pre>
</div>
</div>

<div id="outline-container-org3644716" class="outline-2">
<h2 id="org3644716"><span class="section-number-2">3</span> Reading binary file in Rust</h2>
<div class="outline-text-2" id="text-3">
<p>
So let's start building a 6502 disassembler in Rust, the first step is reading the ROM file.
</p>

<p>
Since it is a binary file, we can read the whole file as a Vector of bytes (<code>Vec&lt;u8&gt;</code>):
</p>

<pre class="example">
use std::io::prelude::*;
use std::fs::File;

fn main() {
    let mut f = File::open("code.bin").unwrap();
    let mut program = Vec::new();
    let length = f.read_to_end(&amp;mut program).unwrap();
    ...
}
</pre>

<p>
Remember that we use <code>unwrap()</code> here just because we are prototyping, it must be handled properly in production.
</p>

<p>
We open the file with <code>std::fs::File::open()</code> function then read the whole file with <code>std::fs::File::read_to_end()</code> function. The result of this function is the length of the input program.
</p>
</div>
</div>

<div id="outline-container-org792cb95" class="outline-2">
<h2 id="org792cb95"><span class="section-number-2">4</span> Parsing Opcode from byte vector</h2>
<div class="outline-text-2" id="text-4">
<p>
Now we have the byte vector <code>program</code>. We need to define a <b><b>program counter</b></b> which tells us where we are in the code. 
</p>

<pre class="example">
let mut pc = 0;
</pre>

<p>
The next is scanning the program and parsing the Opcode:
</p>

<pre class="example">
while pc &lt; length {
    let low = program[pc] &amp; 0x000F;
    let high = (program[pc] &amp; 0x00F0) &gt;&gt; 4;
    ...
}
</pre>

<p>
For each iteration, use the simple <code>if</code> statement to parse the Opcode as well as its Operands, for example, <code>A9</code> is the denoted of <code>LDA #</code>, which has one operand in the next byte. So we parse it with this code:
</p>

<pre class="example">
if high == 0xA &amp;&amp; low == 0x9 {
    let param = program[pc + 1];
    println!("LDA #${:02X}", param);
    pc += 2;
}
</pre>

<p>
The <code>LDA #</code> instruction takes up to <b><b>two bytes</b></b>, so at the end of the <code>if</code> statement, we increase the <b><b>program counter</b></b> by 2.
</p>
</div>
</div>

<div id="outline-container-orge543760" class="outline-2">
<h2 id="orge543760"><span class="section-number-2">5</span> Use match to write code faster</h2>
<div class="outline-text-2" id="text-5">
<p>
Repeatedly writing <code>if</code> statements is not fun, let's make it better by using <code>match</code> on a tuple of <code>(high, low)</code>:
</p>

<pre class="example">
match (high, low) {
    (0xA, 0x9) =&gt; {
        let param = program[pc + 1];
        println!("\t\t LDA #${:02X}", param);
        pc += 2;
    },
    (0x8, 0xD) =&gt; {
        let params = (program[pc + 1], program[pc + 2]);
        println!("\t\t STA ${:02X}{:02X}", params.1, params.0);
        pc += 3;
    },
    (_, _) =&gt; {}
}
</pre>
</div>
</div>

<div id="outline-container-orgec4cac2" class="outline-2">
<h2 id="orgec4cac2"><span class="section-number-2">6</span> What's next?</h2>
<div class="outline-text-2" id="text-6">
<p>
From now, you already know the format of 6502 programs, and how to read them, you can follow the instruction set to finish your disassembler. 
</p>

<p>
The next step is to use the same code logic as the disassembler to implement the actual behavior of 6502 microprocessors <b><b>Fetch-Decode-Execute</b></b> cycle. We will talk about it in another article.
</p>

<p>
I hope you enjoy the post. Any feedback would be greatly appreciated!
</p>

<hr />

<p>
<b><b>Edit:</b></b>
Thanks to the comments of <a href="https://www.reddit.com/r/rust/comments/5uuwet/some_notes_on_writing_6520_disassembler_in_rust/ddx5q6c/">/u/latrasis</a> and <a href="https://www.reddit.com/r/rust/comments/5uuwet/some_notes_on_writing_6520_disassembler_in_rust/ddx5ufn/">/u/vopi181</a> on Reddit, I fixed the typo in the title and removed the <code>macro</code> part because using <code>match</code> is better.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Huy Tran</p>
<p class="date">Created: 2018-06-28 Thu 17:52</p>
<p class="validation"></p>
</div>
</body>
</html>
